ARMmbed/mbed-os/targets/TARGET_TI/TARGET_CC32XX/TARGET_CC3220SF/device/cc3200_simplelink.cpp
/* CC3200_SIMPLELINK Class
 * Copyright (c) 2018 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <stdlib.h>
#include "cc3200_simplelink.h"
#include "nsapi_types.h"
#include "ip4string.h"
#include "CC3220SF_Init.h"

#define SOCKET_IS_NON_BLOCKING  (1)

#define SL_STOP_TIMEOUT         (200)

CC3200_SIMPLELINK::CC3200_SIMPLELINK()
    : _connect_error(0),
      _initialized(false),
      _current_role(0),
      _fail(false),
      _closed(false),
      _connection_status(NSAPI_STATUS_DISCONNECTED),
      _connected_ssid(),
      _connected_channel(0),
      _timeout(CC3200_SIMPLELINK_MISC_TIMEOUT)
{
    memset(_ip_buffer, 0, sizeof(_ip_buffer));
    memset(_gateway_buffer, 0, sizeof(_gateway_buffer));
    memset(_netmask_buffer, 0, sizeof(_netmask_buffer));
    memset(_mac_buffer, 0, sizeof(_mac_buffer));
}

/*!
    \brief          Configure SimpleLink to default state.

    This routine configures the device to a default state.
    It's important to note that this is one example for a 'restore to default state'
    function, which meet the needs of this application, 'Network Terminal'. User who
    wish to incorporate this function into he's app, must adjust the implementation
    and make sure it meets he's needs.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would return -1.

*/
nsapi_error_t CC3200_SIMPLELINK::initialize()
{
    int ret = NSAPI_ERROR_OK;

    if (!_initialized)
    {
        ret = CC3220SF_initSimplelink();
        if (ret == 0)
        {
            _current_role = WIFI_ROLE_STATION;
            _initialized = true;
        }
        else
        {
            printf("simplelink_powerup failed with %d", ret);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }
    return NSAPI_ERROR_OK;
}

bool CC3200_SIMPLELINK::startup(int role)
{
    int32_t ret_val = -1;
    if (role != WIFI_ROLE_STATION && role != WIFI_ROLE_AP && role != WIFI_ROLE_P2P)
    {
        return false;
    }
    if (role != _current_role)
    {
        ret_val = sl_WlanSetMode(role);
        assert(ret_val == 0);

        /* For changes to take affect, we restart the NWP */
        ret_val = sl_Stop(SL_STOP_TIMEOUT);
        assert(ret_val == 0);

        ret_val = sl_Start(0, 0, 0);
        assert(ret_val == 0);
        _current_role = role;
    }
    return true;
}

// TODO: This will involve file system write
bool CC3200_SIMPLELINK::dhcp(bool enabled, int role)
{
#ifdef FILE_SYSTEM_ENABLE
    int32_t ret_val = -1;
    uint32_t config_id, config_option;

    if (role != WIFI_ROLE_STATION && role != WIFI_ROLE_AP)
    {
        return false;
    }

    if (role == WIFI_ROLE_STATION)
    {
        config_id = SL_NETCFG_IPV4_STA_ADDR_MODE;
    }
    else
    {
        config_id = SL_NETCFG_IPV4_AP_ADDR_MODE;
    }
    if (enabled)
    {
        config_option = SL_NETCFG_ADDR_DHCP;
        ret_val = sl_NetCfgSet(config_id, config_option, 0, 0);
    }
    else
    {
        config_option = SL_NETCFG_ADDR_STATIC;
        SlNetCfgIpV4Args_t ipV4;
        ipV4.Ip          = (_u32)SL_IPV4_VAL(_ip_buffer[0],_ip_buffer[1],_ip_buffer[2],_ip_buffer[3]);                     // _u32 IP address
        ipV4.IpMask      = (_u32)SL_IPV4_VAL(_netmask_buffer[0],_netmask_buffer[1],_netmask_buffer[2],_netmask_buffer[3]); // _u32 Subnet mask for this STA/P2P
        ipV4.IpGateway   = (_u32)SL_IPV4_VAL(_gateway_buffer[0],_gateway_buffer[1],_gateway_buffer[2],_gateway_buffer[3]); // _u32 Default gateway address
        ipV4.IpDnsServer = (_u32)SL_IPV4_VAL(_dns_server_buffer[0],_dns_server_buffer[1],_dns_server_buffer[2],_dns_server_buffer[3]); // _u32 DNS server address
        ret_val = sl_NetCfgSet(config_id, config_option, sizeof(SlNetCfgIpV4Args_t), (_u8 *)&ipV4);
    }
    if (ret_val == 0)
    {
        sl_Stop(0);
        sl_Start(NULL,NULL,NULL);
        return true;
    }
    else
    {
        return false;
    }
#else
    return true;
#endif
}

nsapi_error_t CC3200_SIMPLELINK::connect(const char *ssid, const char *passPhrase, nsapi_security_t security)
{
    nsapi_error_t status;
    _i16 ret;
    SlWlanSecParams_t sec_params;

    if (!ssid || (!passPhrase && security != NSAPI_SECURITY_NONE))
    {
        printf("Invalid credentials\r\n");
        return NSAPI_ERROR_PARAMETER;
    }

    status = initialize();
    if(status != NSAPI_ERROR_OK)
    {
        return status;
    }

    strncpy(_connected_ssid, ssid, sizeof(_connected_ssid));

    memset((void*)&sec_params, 0, sizeof(sec_params));

    startup(CC3200_SIMPLELINK::WIFI_ROLE_STATION);
    if(status != NSAPI_ERROR_OK)
    {
        return status;
    }

    sec_params.Key = (signed char*)passPhrase;
    sec_params.KeyLen = strlen(passPhrase);
    switch (security) {
        case NSAPI_SECURITY_WPA:
        case NSAPI_SECURITY_WPA2:
        case NSAPI_SECURITY_WPA_WPA2:
            sec_params.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
            break;
        case NSAPI_SECURITY_WEP:
            sec_params.Type = SL_WLAN_SEC_TYPE_WEP;
            break;
        case NSAPI_SECURITY_NONE:
            sec_params.Type = SL_WLAN_SEC_TYPE_OPEN;
            break;
        default:
            return NSAPI_ERROR_PARAMETER;
    }
    ret = sl_WlanConnect((const _i8*)ssid,(const _i16)(strlen(ssid)),(const _u8 *)NULL,
                         (const SlWlanSecParams_t*)&sec_params ,(const SlWlanSecParamsExt_t*)NULL);
    if (ret != SL_RET_CODE_OK) {
        return NSAPI_ERROR_NO_CONNECTION;
    }

    return NSAPI_ERROR_OK;
}

