ARMmbed/mbed-os/targets/TARGET_TI/TARGET_CC32XX/TARGET_CC3220SF/device/cc3200_simplelink.cpp
bool CC3200_SIMPLELINK::disconnect()
{
    return (sl_WlanDisconnect() == 0);
}

const char *CC3200_SIMPLELINK::getIPAddress()
{
    int i;
    _u16 config_id;
    _u8 ip4addr[4];

    if (_current_role == WIFI_ROLE_STATION) // TODO: Station or P2P client
    {
        config_id = SL_NETCFG_IPV4_STA_ADDR_MODE;
    }
    else
    {
        config_id = SL_NETCFG_IPV4_AP_ADDR_MODE; // AP or P2P go
    }
    _u16 len = sizeof(SlNetCfgIpV4Args_t);
    _u16 ConfigOpt = 0;   //return value could be one of the following: SL_NETCFG_ADDR_DHCP / SL_NETCFG_ADDR_DHCP_LLA / SL_NETCFG_ADDR_STATIC
    SlNetCfgIpV4Args_t ipV4 = {0};

    sl_NetCfgGet(config_id,&ConfigOpt,&len,(_u8 *)&ipV4);
    /*printf("DHCP is %s IP %d.%d.%d.%d MASK %d.%d.%d.%d GW %d.%d.%d.%d DNS %d.%d.%d.%d\n",
        (ConfigOpt == SL_NETCFG_ADDR_DHCP) ? "ON" : "OFF",
        (int)SL_IPV4_BYTE(ipV4.Ip,3),(int)SL_IPV4_BYTE(ipV4.Ip,2),(int)SL_IPV4_BYTE(ipV4.Ip,1),(int)SL_IPV4_BYTE(ipV4.Ip,0),
        (int)SL_IPV4_BYTE(ipV4.IpMask,3),(int)SL_IPV4_BYTE(ipV4.IpMask,2),(int)SL_IPV4_BYTE(ipV4.IpMask,1),(int)SL_IPV4_BYTE(ipV4.IpMask,0),
        (int)SL_IPV4_BYTE(ipV4.IpGateway,3),(int)SL_IPV4_BYTE(ipV4.IpGateway,2),(int)SL_IPV4_BYTE(ipV4.IpGateway,1),(int)SL_IPV4_BYTE(ipV4.IpGateway,0),
        (int)SL_IPV4_BYTE(ipV4.IpDnsServer,3),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,2),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,1),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,0));*/
    for (i = 0; i < 4; i ++)
    {
        ip4addr[i] = SL_IPV4_BYTE(ipV4.Ip,(3-i));
    }
    ip4tos((const void *)ip4addr, (char *)_ip_buffer);

    return _ip_buffer;
}

const char *CC3200_SIMPLELINK::getMACAddress()
{
    _u16 macAddressLen = SL_MAC_ADDR_LEN;
    _u16 ConfigOpt = 0;
    _u8  macAddress[SL_MAC_ADDR_LEN];

    sl_NetCfgGet(SL_NETCFG_MAC_ADDRESS_GET,&ConfigOpt,&macAddressLen,macAddress);
    // Format this into xx:xx:xx:xx:xx:xx
    sprintf(_mac_buffer, "%2x:%2x:%2x:%2x:%2x:%2x",macAddress[0], macAddress[1], macAddress[2], macAddress[3], macAddress[4], macAddress[5]);
    return _mac_buffer;
}

const char *CC3200_SIMPLELINK::getGateway()
{
    int i;
    _u16 config_id;
    _u8 ip4addr[4];

    if (_current_role == WIFI_ROLE_STATION) // TODO: Station or P2P client
    {
        config_id = SL_NETCFG_IPV4_STA_ADDR_MODE;
    }
    else
    {
        config_id = SL_NETCFG_IPV4_AP_ADDR_MODE; // AP or P2P go
    }
    _u16 len = sizeof(SlNetCfgIpV4Args_t);
    _u16 ConfigOpt = 0;   //return value could be one of the following: SL_NETCFG_ADDR_DHCP / SL_NETCFG_ADDR_DHCP_LLA / SL_NETCFG_ADDR_STATIC
    SlNetCfgIpV4Args_t ipV4 = {0};

    sl_NetCfgGet(config_id,&ConfigOpt,&len,(_u8 *)&ipV4);
    /*printf("DHCP is %s IP %d.%d.%d.%d MASK %d.%d.%d.%d GW %d.%d.%d.%d DNS %d.%d.%d.%d\n",
        (ConfigOpt == SL_NETCFG_ADDR_DHCP) ? "ON" : "OFF",
        (int)SL_IPV4_BYTE(ipV4.Ip,3),(int)SL_IPV4_BYTE(ipV4.Ip,2),(int)SL_IPV4_BYTE(ipV4.Ip,1),(int)SL_IPV4_BYTE(ipV4.Ip,0),
        (int)SL_IPV4_BYTE(ipV4.IpMask,3),(int)SL_IPV4_BYTE(ipV4.IpMask,2),(int)SL_IPV4_BYTE(ipV4.IpMask,1),(int)SL_IPV4_BYTE(ipV4.IpMask,0),
        (int)SL_IPV4_BYTE(ipV4.IpGateway,3),(int)SL_IPV4_BYTE(ipV4.IpGateway,2),(int)SL_IPV4_BYTE(ipV4.IpGateway,1),(int)SL_IPV4_BYTE(ipV4.IpGateway,0),
        (int)SL_IPV4_BYTE(ipV4.IpDnsServer,3),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,2),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,1),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,0));*/
    for (i = 0; i < 4; i ++)
    {
        ip4addr[i] = SL_IPV4_BYTE(ipV4.IpGateway,(3-i));
    }
    ip4tos((const void *)ip4addr, (char *)_gateway_buffer);
    return _gateway_buffer;
}

const char *CC3200_SIMPLELINK::getNetmask()
{
    int i;
    _u16 config_id;
    _u8 ip4addr[4];

    if (_current_role == WIFI_ROLE_STATION) // TODO: Station or P2P client
    {
        config_id = SL_NETCFG_IPV4_STA_ADDR_MODE;
    }
    else
    {
        config_id = SL_NETCFG_IPV4_AP_ADDR_MODE; // AP or P2P go
    }
    _u16 len = sizeof(SlNetCfgIpV4Args_t);
    _u16 ConfigOpt = 0;   //return value could be one of the following: SL_NETCFG_ADDR_DHCP / SL_NETCFG_ADDR_DHCP_LLA / SL_NETCFG_ADDR_STATIC
    SlNetCfgIpV4Args_t ipV4 = {0};

    sl_NetCfgGet(config_id,&ConfigOpt,&len,(_u8 *)&ipV4);
    /*printf("DHCP is %s IP %d.%d.%d.%d MASK %d.%d.%d.%d GW %d.%d.%d.%d DNS %d.%d.%d.%d\n",
        (ConfigOpt == SL_NETCFG_ADDR_DHCP) ? "ON" : "OFF",
        (int)SL_IPV4_BYTE(ipV4.Ip,3),(int)SL_IPV4_BYTE(ipV4.Ip,2),(int)SL_IPV4_BYTE(ipV4.Ip,1),(int)SL_IPV4_BYTE(ipV4.Ip,0),
        (int)SL_IPV4_BYTE(ipV4.IpMask,3),(int)SL_IPV4_BYTE(ipV4.IpMask,2),(int)SL_IPV4_BYTE(ipV4.IpMask,1),(int)SL_IPV4_BYTE(ipV4.IpMask,0),
        (int)SL_IPV4_BYTE(ipV4.IpGateway,3),(int)SL_IPV4_BYTE(ipV4.IpGateway,2),(int)SL_IPV4_BYTE(ipV4.IpGateway,1),(int)SL_IPV4_BYTE(ipV4.IpGateway,0),
        (int)SL_IPV4_BYTE(ipV4.IpDnsServer,3),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,2),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,1),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,0));*/
    for (i = 0; i < 4; i ++)
    {
        ip4addr[i] = SL_IPV4_BYTE(ipV4.IpMask,(3-i));
    }
    ip4tos((const void *)ip4addr, (char *)_netmask_buffer);
    return _netmask_buffer;
}

nsapi_error_t CC3200_SIMPLELINK::getDNS(unsigned char* ip4addr, uint32_t size)
{
    int i;
    _u16 config_id;

    if (ip4addr == NULL || size < 4)
    {
        return NSAPI_ERROR_PARAMETER;
    }
    if (_current_role == WIFI_ROLE_STATION) // TODO: Station or P2P client
    {
        config_id = SL_NETCFG_IPV4_STA_ADDR_MODE;
    }
    else
    {
        config_id = SL_NETCFG_IPV4_AP_ADDR_MODE; // AP or P2P go
    }
    _u16 len = sizeof(SlNetCfgIpV4Args_t);
    _u16 ConfigOpt = 0;   //return value could be one of the following: SL_NETCFG_ADDR_DHCP / SL_NETCFG_ADDR_DHCP_LLA / SL_NETCFG_ADDR_STATIC
    SlNetCfgIpV4Args_t ipV4 = {0};

    sl_NetCfgGet(config_id,&ConfigOpt,&len,(_u8 *)&ipV4);
    /*printf("DHCP is %s IP %d.%d.%d.%d MASK %d.%d.%d.%d GW %d.%d.%d.%d DNS %d.%d.%d.%d\n",
        (ConfigOpt == SL_NETCFG_ADDR_DHCP) ? "ON" : "OFF",
        (int)SL_IPV4_BYTE(ipV4.Ip,3),(int)SL_IPV4_BYTE(ipV4.Ip,2),(int)SL_IPV4_BYTE(ipV4.Ip,1),(int)SL_IPV4_BYTE(ipV4.Ip,0),
        (int)SL_IPV4_BYTE(ipV4.IpMask,3),(int)SL_IPV4_BYTE(ipV4.IpMask,2),(int)SL_IPV4_BYTE(ipV4.IpMask,1),(int)SL_IPV4_BYTE(ipV4.IpMask,0),
        (int)SL_IPV4_BYTE(ipV4.IpGateway,3),(int)SL_IPV4_BYTE(ipV4.IpGateway,2),(int)SL_IPV4_BYTE(ipV4.IpGateway,1),(int)SL_IPV4_BYTE(ipV4.IpGateway,0),
        (int)SL_IPV4_BYTE(ipV4.IpDnsServer,3),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,2),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,1),(int)SL_IPV4_BYTE(ipV4.IpDnsServer,0));*/
    for (i = 0; i < 4; i ++)
    {
        ip4addr[i] = SL_IPV4_BYTE(ipV4.IpDnsServer,(3-i));
    }
    return NSAPI_ERROR_OK;
}

