ARMmbed/mbed-os/targets/TARGET_TI/TARGET_CC32XX/TARGET_CC3220SF/device/cc3200_simplelink.cpp
int CC3200_SIMPLELINK::scan(WiFiAccessPoint *res, unsigned count)
{
    _u8          entries_count = MAX_SCAN_ENTRIES;
    uint8_t      triggeredScanTrials = 0;
    _i16         ret = 0;

    if ((count != 0) && (count < MAX_SCAN_ENTRIES))
    {
        entries_count = count;
    }

    /* Get scan results from NWP - results would be placed inside the local buffer first */
    ret = sl_WlanGetNetworkList(0, entries_count, netEntries);

    /* If scan policy isn't set, invoking 'sl_WlanGetNetworkList()' for the first time triggers 'one shot' scan.
     * The scan parameters would be according to the system persistent settings on enabled channels.
     * For more information, see: <simplelink user guide, page: pr.>
     */

    if(SL_ERROR_WLAN_GET_NETWORK_LIST_EAGAIN == ret)
    {
        while(triggeredScanTrials < MAX_SCAN_ATTEMPTS)
        {
            /* We wait for one second for the NWP to complete the initiated scan and collect results */
            wait(1);

            /* Collect results form one-shot scans.*/
            ret = sl_WlanGetNetworkList(0, entries_count, netEntries);
            if(ret > 0)
            {
                break;
            }
            else
            {
                /* If NWP results aren't ready, try 'MAX_SCAN_ATTEMPTS' to get results */
                triggeredScanTrials++ ;
                printf("Tried %d times", triggeredScanTrials);
            }
        }

        if (count == 0 || res == NULL)
        {
            if (ret > 0)
            {
                return ret;
            }
            else
            {
                printf("\n\r[scan] : Unable to retrieve the network list\n\r");
                return 0;
            }
        }
    }
    if (ret <= 0)
    {
        printf("\n\r[scan] : Unable to retrieve the network list\n\r");
        return 0;
    }
    // scan is successful if code reaches here.
    if (res && count)
    {
        unsigned i;

        for (i = 0; i < count; i ++)
        {
            nsapi_wifi_ap_t ap;
            netEntries[i].Ssid[netEntries[i].SsidLen] = 0; /* Ensure the SSID is null terminated */
            memset((void*)&ap, 0x00, sizeof(nsapi_wifi_ap_t));
            memcpy(ap.ssid, netEntries[i].Ssid, netEntries[i].SsidLen);
            memcpy(ap.bssid, netEntries[i].Bssid, 6);
            switch (SL_WLAN_SCAN_RESULT_SEC_TYPE_BITMAP(netEntries[i].SecurityInfo))
            {
                case SL_WLAN_SECURITY_TYPE_BITMAP_OPEN:
                    ap.security = NSAPI_SECURITY_NONE;
                    break;
                case SL_WLAN_SECURITY_TYPE_BITMAP_WEP:
                    ap.security = NSAPI_SECURITY_WEP;
                    break;
                case SL_WLAN_SECURITY_TYPE_BITMAP_WPA:
                    ap.security = NSAPI_SECURITY_WPA;
                    break;
                case SL_WLAN_SECURITY_TYPE_BITMAP_WPA2:
                    ap.security = NSAPI_SECURITY_WPA2;
                    break;
               case (SL_WLAN_SECURITY_TYPE_BITMAP_WPA | SL_WLAN_SECURITY_TYPE_BITMAP_WPA2):
                   ap.security = NSAPI_SECURITY_WPA_WPA2;
                   break;
               default:
                   ap.security = NSAPI_SECURITY_UNKNOWN;
                   break;
            }
            ap.rssi = netEntries[i].Rssi;
            ap.channel = netEntries[i].Channel;
            res[i] = WiFiAccessPoint(ap);
        }
        return count;
    }
    else // Either res == NULL or count == 0, return the number of scanned networks
    {
        return ret;
    }
}

nsapi_error_t CC3200_SIMPLELINK::set_channel(int channel)
{
    if (_current_role == WIFI_ROLE_STATION)
    {
        return NSAPI_ERROR_UNSUPPORTED;
    }

    _i16 Status = sl_WlanSet(SL_WLAN_CFG_AP_ID, SL_WLAN_AP_OPT_CHANNEL, 1, (unsigned char*)&channel);
    if (Status == SL_RET_CODE_OK)
    {
        _connected_channel = channel;
        return NSAPI_ERROR_OK;
    }
    else if (Status == SL_ERROR_INVALID_PARAM)
    {
        return NSAPI_ERROR_PARAMETER;
    }
    else
    {
        return NSAPI_ERROR_DEVICE_ERROR;
    }
}

nsapi_error_t CC3200_SIMPLELINK::dns_lookup(const char *name, char *ip, uint32_t ip_size, nsapi_version_t version)
{
    _i16 Status;
    SlNetAppDnsClientTime_t Time;
    Time.MaxResponseTime = 2000; // Max DNS retry timeout, DNS request timeout changed every retry, start with 100Ms up to MaxResponseTime Ms
    Time.NumOfRetries = 30; // number DNS retries before sl_NetAppDnsGetHostByName failed
    Status = sl_NetAppSet(SL_NETAPP_DNS_CLIENT_ID, SL_NETAPP_DNS_CLIENT_TIME, sizeof(Time), (_u8*)&Time);
    if( Status )
    {
        return NSAPI_ERROR_DNS_FAILURE;
    }
    if (name && ip)
    {
        if ((version == NSAPI_IPv4 || version == NSAPI_UNSPEC) && ip_size >= NSAPI_IPv4_BYTES)
        {
            if (sl_NetAppDnsGetHostByName((_i8*)name, strlen(name), (_u32 *)ip, SL_AF_INET) == 0)
            {
                printf("%s has ip %d.%d.%d.%d\n", name, (int)SL_IPV4_BYTE(*(_u32 *)ip,3),(int)SL_IPV4_BYTE(*(_u32 *)ip,2),(int)SL_IPV4_BYTE(*(_u32 *)ip,1),(int)SL_IPV4_BYTE(*(_u32 *)ip,0));
                return NSAPI_ERROR_OK;
            }
            else
            {
                printf("sl_NetAppDnsGetHostByName failed\n");
                return NSAPI_ERROR_DNS_FAILURE;
            }
        }
        if (version == NSAPI_IPv6 && ip_size >= NSAPI_IPv6_BYTES)
        {
            if (sl_NetAppDnsGetHostByName((_i8*)name, strlen(name), (_u32 *)ip, SL_AF_INET6) == 0)
            {
                return NSAPI_ERROR_OK;
            }
            else
            {
                return NSAPI_ERROR_DNS_FAILURE;
            }
        }
    }
    return NSAPI_ERROR_DNS_FAILURE;
}

int8_t CC3200_SIMPLELINK::getRSSI()
{
    int i;
    // Match connected network
    for (i = 0; i < MAX_SCAN_ENTRIES; i++)
    {
        if (strcmp((char*)netEntries[i].Ssid, _connected_ssid) == 0 && netEntries[i].Channel == _connected_channel)
        {
            break;
        }
    }
    if (i < MAX_SCAN_ENTRIES)
    {
        return netEntries[i].Rssi;
    }
    else
    {
        printf("Unscanned network, initiate network scan to get valid RSSI.\n");
        return 0;
    }
}

int8_t CC3200_SIMPLELINK::get_current_wifi_mode()
{
    return _current_role;
}

nsapi_connection_status_t CC3200_SIMPLELINK::get_connection_status() const
{
    return _connection_status;
}

