ARMmbed/mbed-os/targets/TARGET_TI/TARGET_CC32XX/TARGET_CC3220SF/device/cc3200_simplelink.cpp
void CC3200_SIMPLELINK::set_connection_status(nsapi_connection_status_t status)
{
    _connection_status = status;
    if(_connection_status_cb)
    {
        _connection_status_cb(NSAPI_EVENT_CONNECTION_STATUS_CHANGE, _connection_status);
    }
}

void CC3200_SIMPLELINK::attach(mbed::Callback<void(nsapi_event_t, intptr_t)> status_cb)
{
    _connection_status_cb = status_cb;
}

nsapi_error_t CC3200_SIMPLELINK::open_socket(nsapi_protocol_t proto)
{
    int32_t             sock = 0;

    if (proto == NSAPI_TCP)
    {
        sock = sl_Socket(SL_AF_INET, SL_SOCK_STREAM, 0);
    }
    else if (proto == NSAPI_UDP)
    {
        sock = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, 0);
    }
    if (sock >= 0)
    {
        return sock;
    }
    else
    {
        printf("open_socket failed with %d\n", (int)sock);
        return NSAPI_ERROR_NO_SOCKET;
    }
}

bool CC3200_SIMPLELINK::close_socket(uint32_t sock)
{
    int32_t            retcode = 0;

    retcode = sl_Close(sock);
    if (retcode == 0)
    {
        return true;
    }
    else
    {
        printf("close_socket failed with %d\n", (int)retcode);
        return false;
    }
}
nsapi_error_t CC3200_SIMPLELINK::setsockopt(uint32_t sd, int level,
        int optname, const void *optval, unsigned optlen)
{
    _i16 retcode = sl_SetSockOpt((_i16)sd, level, optname, optval, optlen);
    if (retcode == 0)
    {
        return NSAPI_ERROR_OK;
    }
    else
    {
        printf ("sl_SetSockOpt failed with %d\n", (int)retcode);
        return NSAPI_ERROR_DEVICE_ERROR;
    }
}

nsapi_error_t CC3200_SIMPLELINK::getsockopt(uint32_t sd, int level,
        int optname, void *optval, unsigned* optlen)
{
    _i16 retcode =sl_GetSockOpt((_i16)sd, level, optname, optval, (SlSocklen_t*)optlen);
    if (retcode == 0)
    {
        return NSAPI_ERROR_OK;
    }
    else
    {
        printf ("sl_GetSockOpt failed with %d\n", (int)retcode);
        return NSAPI_ERROR_DEVICE_ERROR;
    }
}

nsapi_error_t CC3200_SIMPLELINK::connect_socket(uint32_t sd, const SocketAddress &sock_addr)
{
    sockAddr_t     sAddr;
    SlSockAddr_t*  sa;
    int32_t        addrSize;
    int32_t        status = -1;
    short int      nonBlocking = SOCKET_IS_NON_BLOCKING;

    _fill_sl_address(sAddr, sa, addrSize, sock_addr);

    if (1 == nonBlocking)
    {
        // non-blocking
        status = sl_SetSockOpt((short int)sd, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &nonBlocking, sizeof(nonBlocking));
        if(status < 0)
        {
            printf("sl_SetSockOpt failed with %d\n\r", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }
    status = -1;
    while (status < 0)
    {
        status = sl_Connect((short int)sd, sa, (short int)addrSize);
        // on a non-blocking connect, retry if SL_ERROR_BSD_EALREADY is returned
        {
            if (status == SL_ERROR_BSD_EALREADY && 1 == nonBlocking)
            {
                wait_ms(1);
                continue;
            }
            else if (status < 0)
            {
                printf("sl_Connect failed with %d\n", (int)status);
                return NSAPI_ERROR_DEVICE_ERROR;
            }
        }
    }
    return NSAPI_ERROR_OK;
}

nsapi_error_t CC3200_SIMPLELINK::bind_socket(uint32_t sd, const SocketAddress &sock_addr)
{
    sockAddr_t     sAddr;
    SlSockAddr_t*  sa;
    int32_t        addrSize;
    int32_t        status = -1;

    _fill_sl_address(sAddr, sa, addrSize, sock_addr);

    status = sl_Bind(sd, sa, addrSize);
    if (status == 0)
    {
        return NSAPI_ERROR_OK;
    }
    else
    {
        printf ("sl_Bind failed with %d\n", (int)status);
        return NSAPI_ERROR_DEVICE_ERROR;
    }
}

int CC3200_SIMPLELINK::sendto_socket(uint32_t sd, const void * buf, uint32_t bufLen,  const SocketAddress &sock_addr)
{
    sockAddr_t     sAddr;
    SlSockAddr_t*  sa;
    int32_t        addrSize;
    int32_t        status = -1;

    _fill_sl_address(sAddr, sa, addrSize, sock_addr);

    while (1)
    {
        status = sl_SendTo(sd, buf, bufLen, 0, sa, addrSize);
        if (status == SL_ERROR_BSD_EAGAIN && 1 == SOCKET_IS_NON_BLOCKING)
        {
            wait_ms(1);
            continue;
        }
        else if (status < 0)
        {
            printf ("sl_SendTo failed with %d\n", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        break;
    }
    return status;
}

int32_t CC3200_SIMPLELINK::send(int sd, const void *data, uint32_t size)
{
    int32_t status = -1;

    while (1)
    {
        status = sl_Send(sd, data, size, 0);
        if (status == SL_ERROR_BSD_EAGAIN && 1 == SOCKET_IS_NON_BLOCKING)
        {
            wait_ms(1);
            continue;
        }
        else if (status < 0)
        {
            printf ("sl_Send failed with %d\n", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        break;
    }
    return status;
}

int32_t CC3200_SIMPLELINK::recv(int sd, void *data, uint32_t size)
{
    int32_t             status = -1;
    SlSockNonblocking_t BlockingOption;
    struct SlTimeval_t  TimeVal;

    BlockingOption.NonBlockingEnabled = SOCKET_IS_NON_BLOCKING;

    if (1 == SOCKET_IS_NON_BLOCKING)
    {
        // non-blocking
        status = sl_SetSockOpt((short int)sd, SL_SOL_SOCKET, SL_SO_NONBLOCKING, (_u8*)&BlockingOption,sizeof(BlockingOption));
        if(status < 0)
        {
            printf("sl_SetSockOpt failed with %d\n\r", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }
    else
    {
        /* In case of blocking, a timeout for sl_RecvFrom will be set to TimeVal
         * When timeout is expired sl_Recv will return SL_ERROR_BSD_EAGAIN */
        TimeVal.tv_sec = _timeout;
        TimeVal.tv_usec = 0;
        status = sl_SetSockOpt(sd,SL_SOL_SOCKET,SL_SO_RCVTIMEO,
                               (uint8_t *)&TimeVal,
                               sizeof(TimeVal));
        if(status < 0)
        {
            printf ("sl_SetSockOpt failed with %d\n", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }

    memset((void *)data, 0, size);

    status = sl_Recv(sd, data, size, 0);
    if(status == SL_ERROR_BSD_EAGAIN)
    {
        if (1 == SOCKET_IS_NON_BLOCKING)
        {
            return NSAPI_ERROR_WOULD_BLOCK;
        }
        else
        {
            printf ("Timeout expired before receiving packet\n");
            return NSAPI_ERROR_TIMEOUT;
        }
    }
    else if(status < 0)
    {
        printf ("sl_Recv failed with %d\n", (int)status);
        return NSAPI_ERROR_DEVICE_ERROR;
    }
    else
    {
        return status;
    }
}

int32_t CC3200_SIMPLELINK::recvfrom(uint32_t sd, void * buf, uint32_t size, SocketAddress &sock_addr)
{
    sockAddr_t          sAddr;
    SlSockAddr_t*       sa;
    int32_t             addrSize;
    int32_t             status = -1;
    SlSockNonblocking_t BlockingOption;
    struct SlTimeval_t  TimeVal;
    nsapi_addr_t        nsapi_addr = sock_addr.get_addr();


    BlockingOption.NonBlockingEnabled = SOCKET_IS_NON_BLOCKING;

    if (1 == SOCKET_IS_NON_BLOCKING)
    {
        // non-blocking
        status = sl_SetSockOpt((short int)sd, SL_SOL_SOCKET, SL_SO_NONBLOCKING, (_u8*)&BlockingOption,sizeof(BlockingOption));
        if(status < 0)
        {
            printf("sl_SetSockOpt failed with %d\n\r", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }
    else
    {
        /* In case of blocking, a timeout for sl_RecvFrom will be set to TimeVal
         * When timeout is expired sl_RecvFrom will return SL_ERROR_BSD_EAGAIN */
        TimeVal.tv_sec = _timeout;
        TimeVal.tv_usec = 0;
        status = sl_SetSockOpt(sd,SL_SOL_SOCKET,SL_SO_RCVTIMEO,
                               (uint8_t *)&TimeVal,
                               sizeof(TimeVal));
        if(status < 0)
        {
            printf ("sl_SetSockOpt failed with %d\n", (int)status);
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }

    memset((void*)buf, 0, size);

    _fill_sl_address(sAddr, sa, addrSize, sock_addr);

