ARMmbed/mbed-os/targets/TARGET_TI/TARGET_CC32XX/TARGET_CC3220SF/device/cc3200_simplelink.cpp
    // sl_RecvFrom requires size to be 1-16000 bytes. Can't pass 0
    if (size == 0)
    {
        status = sl_RecvFrom(sd, buf, 1, 0, sa, (SlSocklen_t*)&addrSize);
    }
    else
    {
        status = sl_RecvFrom(sd, buf, size, 0, sa, (SlSocklen_t*)&addrSize);
    }
    if(status == SL_ERROR_BSD_EAGAIN)
    {
        if (1 == SOCKET_IS_NON_BLOCKING)
        {
            return NSAPI_ERROR_WOULD_BLOCK;
        }
        else
        {
            printf ("Timeout expired before receiving packet\n");
            return NSAPI_ERROR_TIMEOUT;
        }
    }
    else if(status < 0)
    {
        printf ("sl_RecvFrom failed with %d\n", (int)status);
        return NSAPI_ERROR_DEVICE_ERROR;
    }
    else if ((status > 0 && size > 0) || (status == 0 && size == 0))
    {
       // Fill the ip and port
       memset((void*)&nsapi_addr, 0, sizeof(nsapi_addr));
       bool ipv6 = (sock_addr.get_ip_version() == NSAPI_IPv6);
       if (ipv6)
       {
           sock_addr.set_port(sl_Ntohs(sAddr.in6.sin6_port));
           nsapi_addr.version = NSAPI_IPv6;
           *(unsigned long *)&nsapi_addr.bytes[0] = sAddr.in6.sin6_addr._S6_un._S6_u32[0];
           *(unsigned long *)&nsapi_addr.bytes[4] = sAddr.in6.sin6_addr._S6_un._S6_u32[1];
           *(unsigned long *)&nsapi_addr.bytes[8] = sAddr.in6.sin6_addr._S6_un._S6_u32[2];
           *(unsigned long *)&nsapi_addr.bytes[12] = sAddr.in6.sin6_addr._S6_un._S6_u32[3];
           sock_addr.set_addr(nsapi_addr);
       }
       else
       {
           sock_addr.set_port(sl_Ntohs(sAddr.in4.sin_port));
           nsapi_addr.version = NSAPI_IPv4;
           *(unsigned int*)nsapi_addr.bytes = sAddr.in4.sin_addr.s_addr;
           sock_addr.set_addr(nsapi_addr);
       }
    }
    return status;
}

void CC3200_SIMPLELINK::setTimeout(uint32_t timeout_ms)
{
    _timeout = timeout_ms;
}

void CC3200_SIMPLELINK::_fill_sl_address(sockAddr_t &sAddr, SlSockAddr_t* &sa, int32_t &addrSize, const SocketAddress &sock_addr)
{
    nsapi_addr_t        nsapi_addr = sock_addr.get_addr();
    bool ipv6 = (sock_addr.get_ip_version() == NSAPI_IPv6);

    memset((void*)&sAddr, 0, sizeof(sAddr));

    if (ipv6)
    {
        sAddr.in6.sin6_family = SL_AF_INET6;
        sAddr.in6.sin6_port    = sl_Htons(sock_addr.get_port());
        sAddr.in6.sin6_flowinfo = 0;

        sAddr.in6.sin6_addr._S6_un._S6_u32[0] = *(unsigned long *)&nsapi_addr.bytes[0];
        sAddr.in6.sin6_addr._S6_un._S6_u32[1] = *(unsigned long *)&nsapi_addr.bytes[4];
        sAddr.in6.sin6_addr._S6_un._S6_u32[2] = *(unsigned long *)&nsapi_addr.bytes[8];
        sAddr.in6.sin6_addr._S6_un._S6_u32[3] = *(unsigned long *)&nsapi_addr.bytes[12];
        sa = (SlSockAddr_t*)&sAddr.in6;
        addrSize = sizeof(SlSockAddrIn6_t);
    }
    else
    {
        sAddr.in4.sin_family = SL_AF_INET;
        sAddr.in4.sin_port = sl_Htons(sock_addr.get_port());
        sAddr.in4.sin_addr.s_addr = *(unsigned int*)nsapi_addr.bytes;
        sa = (SlSockAddr_t*)&sAddr.in4;
        addrSize = sizeof(SlSockAddrIn_t);
    }
}
